//ПРИМЕР ПЕРВЫЙ =============================================

// int a = 12;

// while (a > 0)
// {
//     Console.WriteLine(a);
//     a = a - 1;
// }

// Console.WriteLine("Все");

// ПРИМЕР ВТОРОЙ (пропуск элемента в цикле) =============================================

// int a = 13;

// while (a > 0)
// {
//     a--;
//     if((a == 6) | (a == 4))
//     {
//         continue; 
//     }
//     Console.WriteLine(a);
// }

// ПРИМЕР ТРЕТИЙ (выход из цикла) =============================================

// int a = 8;

// while (a > 0)
// {
//     a--;
//     if((a == 2) | (a == 4))
//     {
//         break; 
//     }
//     Console.WriteLine(a);
// }

// ПРИМЕР ЧЕТВЕРТЫЙ (цикл for) =============================================

int a = 1;

for (int i = 1; i < 5; i++)
{
    Console.WriteLine(a);
    a = a + 1;
}

Console.WriteLine("Все");

// ================================================================================

